**ðŸ§­ Stage 1 â†’ Lesson 5: Basic Data Operations**

**ðŸŽ¯ Objective**

By the end of this lesson youâ€™ll be able to:
- Select columns and rows precisely
- Filter data using conditions
- Sort and rename columns
- Modify and clean simple datasets
- Apply quick column-level calculations

**ðŸ§± Load a Sample Dataset**

In [118]:
import pandas as pd
import numpy as np

In [119]:
# Import the pandas library â€” used for data manipulation and analysis
import pandas as pd

# Define the path to the Excel file containing the raw dataset.
# The 'r' before the string makes it a raw string, so backslashes are treated literally.
pb_url = r"C:\Users\dhira\Desktop\GENAI\pandas\dataset\raw\people_basic_data.xlsx"

# Read the Excel file into a pandas DataFrame.
# pd.read_excel() automatically infers column names and data types.
df_pb = pd.read_excel(pb_url)

# Display the first 5 rows of the DataFrame to verify that data has been loaded correctly.
# This is a quick way to inspect column names, data types, and check for missing or malformed data.
print(df_pb.head())

     Name  Age       City  Salary_INR
0   Aarav   23     Mumbai      115059
1  Vivaan   50  Ahmedabad       93035
2  Aditya   46  Ahmedabad       61033
3  Vihaan   37       Pune      187550
4   Arjun   37      Delhi      162866

**Check structure**

In [120]:
# Display basic information about the DataFrame, such as:
# - The number of rows and columns
# - Column names
# - Non-null counts (to detect missing values)
# - Data types (useful for understanding numeric vs. categorical data)
# Note: df.info() already prints its output to the console, so printing it again isn't necessary.
print("Table information:")
df_pb.info()

# Print a blank line for better readability
print("\nSummary statistics of numerical columns:\n")

# Display descriptive statistics for numerical columns, such as:
# count, mean, standard deviation, min, max, and quartile values (25%, 50%, 75%).
# By default, df.describe() summarizes only numeric columns, 
# but you can include all columns using df.describe(include='all').
print(df_pb.describe())

Table information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        20 non-null     object
 1   Age         20 non-null     int64
 2   City        20 non-null     object
 3   Salary_INR  20 non-null     int64
dtypes: int64(2), object(2)
memory usage: 772.0+ bytes

Summary statistics of numerical columns:

             Age     Salary_INR
count  20.000000      20.000000
mean   41.100000  119167.850000
std    11.497826   46085.245936
min    23.000000   40848.000000
25%    34.750000   89038.500000
50%    43.500000  118890.500000
75%    50.000000  164616.750000
max    59.000000  187550.000000

**ðŸ§© Selecting Data**

| Goal                  | Code                     | Notes                  |
|-----------------------|--------------------------|------------------------|
| Single column         | `df['Name']`             | Returns a Series       |
| Multiple columns      | `df[['Name','City']]`    | Returns a DataFrame    |
| By position           | `df.iloc[:, 0]`          | Column at index 0      |
| Using list of indices | `df.iloc[:, [0, 2]]`     | Specific columns       |

**ðŸ§© Filtering Rows (Simple condition)**

In [121]:
# Filter the DataFrame to include only rows where the 'Age' column value is greater than 30.
# This creates a new DataFrame containing a subset of the original data.
# The condition (df_pb['Age'] > 30) returns a boolean Series (True/False) for each row.
df_pb[df_pb['Age'] > 30]

      Name  Age       City  Salary_INR
1   Vivaan   50  Ahmedabad       93035
2   Aditya   46  Ahmedabad       61033
3   Vihaan   37       Pune      187550
4    Arjun   37      Delhi      162866
5      Sai   54      Noida      139457
7   Ishaan   47    Kolkata      169869
10  Ananya   41  Ahmedabad      106578
11    Diya   59     Mumbai       68630
12    Isha   49       Pune       45663
13  Aadhya   50  Hyderabad      124279
14    Myra   48  Hyderabad      180941
15   Pooja   51      Delhi       40848
16   Vanya   40    Chennai      175909
18   Meera   53  Ahmedabad       77049
19  Aarohi   38     Jaipur      137382

**ðŸ§© Filtering Rows (Multiple condition)**

In [122]:
# Filter the DataFrame to include only rows where BOTH of these conditions are true:
# 1. The 'Age' column value is greater than 25
# 2. The 'City' column value is exactly "Delhi"

# The '&' operator is used to combine multiple conditions (logical AND). 
# Each condition must be enclosed in parentheses due to operator precedence.
# The result is a subset DataFrame containing only the rows that satisfy both criteria.
df_pb[(df_pb['Age'] > 25) & (df_pb['City'] == "Delhi")]

     Name  Age   City  Salary_INR
4   Arjun   37  Delhi      162866
15  Pooja   51  Delhi       40848

**OR condition**

In [123]:
# Select rows where Age > 30 OR City is Mumbai
df_pb[(df_pb["Age"] > 30) | (df_pb["City"] == "Mumbai")]

      Name  Age       City  Salary_INR
0    Aarav   23     Mumbai      115059
1   Vivaan   50  Ahmedabad       93035
2   Aditya   46  Ahmedabad       61033
3   Vihaan   37       Pune      187550
4    Arjun   37      Delhi      162866
5      Sai   54      Noida      139457
7   Ishaan   47    Kolkata      169869
10  Ananya   41  Ahmedabad      106578
11    Diya   59     Mumbai       68630
12    Isha   49       Pune       45663
13  Aadhya   50  Hyderabad      124279
14    Myra   48  Hyderabad      180941
15   Pooja   51      Delhi       40848
16   Vanya   40    Chennai      175909
17   Navya   25     Mumbai      170697
18   Meera   53  Ahmedabad       77049
19  Aarohi   38     Jaipur      137382

**NOT condition**

In [124]:
# Select rows where City is NOT Kolkata
df_pb[~(df_pb['City'] == "Kolkata")]

# Select rows where City is NOT Kolkata (Method 2)
df_pb[df_pb['City'] != "Kolkata"]

       Name  Age       City  Salary_INR
0     Aarav   23     Mumbai      115059
1    Vivaan   50  Ahmedabad       93035
2    Aditya   46  Ahmedabad       61033
3    Vihaan   37       Pune      187550
4     Arjun   37      Delhi      162866
5       Sai   54      Noida      139457
6   Krishna   23  Hyderabad       98410
8    Pranav   28     Jaipur      122722
9     Rohit   23  Ahmedabad      105380
10   Ananya   41  Ahmedabad      106578
11     Diya   59     Mumbai       68630
12     Isha   49       Pune       45663
13   Aadhya   50  Hyderabad      124279
14     Myra   48  Hyderabad      180941
15    Pooja   51      Delhi       40848
16    Vanya   40    Chennai      175909
17    Navya   25     Mumbai      170697
18    Meera   53  Ahmedabad       77049
19   Aarohi   38     Jaipur      137382

**Nested conditions**

In [125]:

# Select rows where (Age > 25 AND City is Delhi) OR (Salary > 50000), and sort by salary_INR
df_pb[((df_pb['Age'] > 25) & (df_pb['City'] == "Delhi")) | (df_pb['Salary_INR'] > 50000)].sort_values(by='Salary_INR',ascending=False)

       Name  Age       City  Salary_INR
3    Vihaan   37       Pune      187550
14     Myra   48  Hyderabad      180941
16    Vanya   40    Chennai      175909
17    Navya   25     Mumbai      170697
7    Ishaan   47    Kolkata      169869
4     Arjun   37      Delhi      162866
5       Sai   54      Noida      139457
19   Aarohi   38     Jaipur      137382
13   Aadhya   50  Hyderabad      124279
8    Pranav   28     Jaipur      122722
0     Aarav   23     Mumbai      115059
10   Ananya   41  Ahmedabad      106578
9     Rohit   23  Ahmedabad      105380
6   Krishna   23  Hyderabad       98410
1    Vivaan   50  Ahmedabad       93035
18    Meera   53  Ahmedabad       77049
11     Diya   59     Mumbai       68630
2    Aditya   46  Ahmedabad       61033
15    Pooja   51      Delhi       40848

**Combination of AND, OR, NOT**

In [126]:
# Select rows where Age > 30 AND (City is NOT Mumbai OR Salary > 70000)
df_pb[(df_pb["Age"] >30) & ((df_pb["City"] != "Mumbai") | (df_pb['Salary_INR'] > 70000))].sort_values(by='Salary_INR', ascending=False)

      Name  Age       City  Salary_INR
3   Vihaan   37       Pune      187550
14    Myra   48  Hyderabad      180941
16   Vanya   40    Chennai      175909
7   Ishaan   47    Kolkata      169869
4    Arjun   37      Delhi      162866
5      Sai   54      Noida      139457
19  Aarohi   38     Jaipur      137382
13  Aadhya   50  Hyderabad      124279
10  Ananya   41  Ahmedabad      106578
1   Vivaan   50  Ahmedabad       93035
18   Meera   53  Ahmedabad       77049
2   Aditya   46  Ahmedabad       61033
12    Isha   49       Pune       45663
15   Pooja   51      Delhi       40848

**Multiple nested conditions**

In [127]:
# Age between 25 and 35, City Delhi or Mumbai, and Salary > 40000
df_pb[((df_pb['Age'] >= 25) & (df_pb['Age'] <= 35)) \
    & ((df_pb['City'] == "Delhi") \
    | (df_pb['City'] == "Mumbai")) \
        & (df_pb['Salary_INR'] > 40000)]

     Name  Age    City  Salary_INR
17  Navya   25  Mumbai      170697

In [128]:
# Select rows where Salary >= 50000 OR Age < 30
df_pb[(df_pb['Salary_INR'] >= 50000) | (df_pb['Age'] < 30)]

       Name  Age       City  Salary_INR
0     Aarav   23     Mumbai      115059
1    Vivaan   50  Ahmedabad       93035
2    Aditya   46  Ahmedabad       61033
3    Vihaan   37       Pune      187550
4     Arjun   37      Delhi      162866
5       Sai   54      Noida      139457
6   Krishna   23  Hyderabad       98410
7    Ishaan   47    Kolkata      169869
8    Pranav   28     Jaipur      122722
9     Rohit   23  Ahmedabad      105380
10   Ananya   41  Ahmedabad      106578
11     Diya   59     Mumbai       68630
13   Aadhya   50  Hyderabad      124279
14     Myra   48  Hyderabad      180941
16    Vanya   40    Chennai      175909
17    Navya   25     Mumbai      170697
18    Meera   53  Ahmedabad       77049
19   Aarohi   38     Jaipur      137382

**ðŸŸ  Intermediate Exercises**

In [129]:
# Select rows where Age between 25 and 35
df_pb[(df_pb['Age'] >= 25) & (df_pb['Age'] <= 35)]

      Name  Age    City  Salary_INR
8   Pranav   28  Jaipur      122722
17   Navya   25  Mumbai      170697

In [130]:
# Select rows where City is either Delhi or Kolkata
df_pb[df_pb['City'].isin(["Delhi", "Kolkata"])]

      Name  Age     City  Salary_INR
4    Arjun   37    Delhi      162866
7   Ishaan   47  Kolkata      169869
15   Pooja   51    Delhi       40848

In [131]:
# Select rows where City is NOT Delhi or Kolkata
df_pb[~df_pb['City'].isin(["Delhi", "Kolkata"])]

       Name  Age       City  Salary_INR
0     Aarav   23     Mumbai      115059
1    Vivaan   50  Ahmedabad       93035
2    Aditya   46  Ahmedabad       61033
3    Vihaan   37       Pune      187550
5       Sai   54      Noida      139457
6   Krishna   23  Hyderabad       98410
8    Pranav   28     Jaipur      122722
9     Rohit   23  Ahmedabad      105380
10   Ananya   41  Ahmedabad      106578
11     Diya   59     Mumbai       68630
12     Isha   49       Pune       45663
13   Aadhya   50  Hyderabad      124279
14     Myra   48  Hyderabad      180941
16    Vanya   40    Chennai      175909
17    Navya   25     Mumbai      170697
18    Meera   53  Ahmedabad       77049
19   Aarohi   38     Jaipur      137382

In [132]:
# Select rows where Salary < 60000 AND City is not Mumbai
df_pb[(df_pb['Salary_INR'] < 60000) & ~(df_pb['City'] == "Mumbai")]

     Name  Age   City  Salary_INR
12   Isha   49   Pune       45663
15  Pooja   51  Delhi       40848

**ðŸ”µ Advanced (Nested / Complex Logic)**

In [133]:
# (Age > 25 AND City is Delhi) OR (Salary > 70000)
df_pb[((df_pb['Age'] > 25) & (df_pb['City'] == "Delhi")) | (df_pb['Salary_INR'] > 70000)]

       Name  Age       City  Salary_INR
0     Aarav   23     Mumbai      115059
1    Vivaan   50  Ahmedabad       93035
3    Vihaan   37       Pune      187550
4     Arjun   37      Delhi      162866
5       Sai   54      Noida      139457
6   Krishna   23  Hyderabad       98410
7    Ishaan   47    Kolkata      169869
8    Pranav   28     Jaipur      122722
9     Rohit   23  Ahmedabad      105380
10   Ananya   41  Ahmedabad      106578
13   Aadhya   50  Hyderabad      124279
14     Myra   48  Hyderabad      180941
15    Pooja   51      Delhi       40848
16    Vanya   40    Chennai      175909
17    Navya   25     Mumbai      170697
18    Meera   53  Ahmedabad       77049
19   Aarohi   38     Jaipur      137382

In [134]:
# City is Delhi OR (City is Mumbai AND Salary > 50000)
df_pb[(df_pb['City'] == "Delhi") | ((df_pb['City'] == "Mumbai") & (df_pb['Salary_INR'] > 50000))]

     Name  Age    City  Salary_INR
0   Aarav   23  Mumbai      115059
4   Arjun   37   Delhi      162866
11   Diya   59  Mumbai       68630
15  Pooja   51   Delhi       40848
17  Navya   25  Mumbai      170697

In [135]:
# Age > 30 AND (City not in ['Delhi', 'Mumbai'])
df_pb[(df_pb['Age'] > 30) & (~df_pb['City'].isin(['Delhi', 'Mumbai']))]

      Name  Age       City  Salary_INR
1   Vivaan   50  Ahmedabad       93035
2   Aditya   46  Ahmedabad       61033
3   Vihaan   37       Pune      187550
5      Sai   54      Noida      139457
7   Ishaan   47    Kolkata      169869
10  Ananya   41  Ahmedabad      106578
12    Isha   49       Pune       45663
13  Aadhya   50  Hyderabad      124279
14    Myra   48  Hyderabad      180941
16   Vanya   40    Chennai      175909
18   Meera   53  Ahmedabad       77049
19  Aarohi   38     Jaipur      137382

In [136]:
# (Age between 25â€“35) AND (City not in ['Kolkata', 'Mumbai']) AND (Salary > 45000)
df_pb[
    ((df_pb['Age'] >= 25) & (df_pb['Age'] <= 35)) &
    (~df_pb['City'].isin(['Kolkata', 'Mumbai'])) &
    (df_pb['Salary_INR'] > 45000)
]

     Name  Age    City  Salary_INR
8  Pranav   28  Jaipur      122722

**ðŸ”¹ Using isin**

In [137]:
# Filter the DataFrame to include only rows where the 'City' column
filtered_df = df_pb[df_pb['City'].isin(['Delhi', 'Mumbai'])]
print(filtered_df)

     Name  Age    City  Salary_INR
0   Aarav   23  Mumbai      115059
4   Arjun   37   Delhi      162866
11   Diya   59  Mumbai       68630
15  Pooja   51   Delhi       40848
17  Navya   25  Mumbai      170697

In [138]:
# Case-insensitive filtering (useful if your data has inconsistent capitalization):

df_pb[df_pb['City'].str.lower().isin(['delhi','mumbai'])]

     Name  Age    City  Salary_INR
0   Aarav   23  Mumbai      115059
4   Arjun   37   Delhi      162866
11   Diya   59  Mumbai       68630
15  Pooja   51   Delhi       40848
17  Navya   25  Mumbai      170697

In [139]:
# Count how many entries match
print("Number of people from Delhi or Mumbai:", df_pb['City'].isin(['Delhi', 'Mumbai']).sum())

Number of people from Delhi or Mumbai: 5

**ðŸ”¹ Using between**

In [ ]:
# Filter the DataFrame to include only rows where the 'Age' column value 
# is between 25 and 40 (inclusive by default).

filtered_df = df_pb[df_pb["Age"].between(25, 40)]
print(filtered_df)

      Name  Age     City  Salary_INR
3   Vihaan   37     Pune      187550
4    Arjun   37    Delhi      162866
8   Pranav   28   Jaipur      122722
16   Vanya   40  Chennai      175909
17   Navya   25   Mumbai      170697
19  Aarohi   38   Jaipur      137382

In [155]:
# Includes 25 but excludes 40
filtered_left = df_pb[df_pb["Age"].between(25, 40, inclusive="left")]
print("Includes 25:\n",filtered_left)

# Includes 40 but excludes 25
filtered_right = df_pb[df_pb["Age"].between(25, 40, inclusive="right")]
print("\nIncludes 40:\n",filtered_right)

# Excludes both 25 and 40
filtered_neither = df_pb[df_pb["Age"].between(25, 40, inclusive="neither")]
print("\nExcludes both 25 and 40:\n",filtered_neither)

Includes 25:
       Name  Age    City  Salary_INR
3   Vihaan   37    Pune      187550
4    Arjun   37   Delhi      162866
8   Pranav   28  Jaipur      122722
17   Navya   25  Mumbai      170697
19  Aarohi   38  Jaipur      137382

Includes 40:
       Name  Age     City  Salary_INR
3   Vihaan   37     Pune      187550
4    Arjun   37    Delhi      162866
8   Pranav   28   Jaipur      122722
16   Vanya   40  Chennai      175909
19  Aarohi   38   Jaipur      137382

Excludes both 25 and 40:
       Name  Age    City  Salary_INR
3   Vihaan   37    Pune      187550
4    Arjun   37   Delhi      162866
8   Pranav   28  Jaipur      122722
19  Aarohi   38  Jaipur      137382

**ðŸ”¹ Using query**

In [160]:
 df_pb.query("Age > 25 and City == 'Delhi'")

     Name  Age   City  Salary_INR
4   Arjun   37  Delhi      162866
15  Pooja   51  Delhi       40848

In [162]:
# ----------------------------------------------
# ðŸ“˜ PANDAS .query() METHOD â€” COMPLETE REFERENCE
# ----------------------------------------------

import pandas as pd

# Sample DataFrame for demonstration
data = {
    'Name': ['Amit', 'Neha', 'Raj', 'Priya', 'Karan', 'Anita'],
    'Age': [22, 27, 35, 29, 40, 25],
    'City': ['Delhi', 'Mumbai', 'Delhi', 'Pune', 'Delhi', 'Chennai'],
    'Salary': [40000, 52000, 61000, 48000, 72000, 45000]
}
df_pb = pd.DataFrame(data)

print("ðŸ”¹ Original DataFrame:\n", df_pb, "\n")

# ----------------------------------------------
# 1ï¸âƒ£ Basic Filtering
# ----------------------------------------------

print("1ï¸âƒ£ Basic Filtering â†’ Age > 25")
print(df_pb.query("Age > 25"), "\n")

# ----------------------------------------------
# 2ï¸âƒ£ Multiple Conditions (AND / OR)
# ----------------------------------------------

print("2ï¸âƒ£ AND condition â†’ Age > 25 and City == 'Delhi'")
print(df_pb.query("Age > 25 and City == 'Delhi'"), "\n")

print("   OR condition â†’ City == 'Delhi' or City == 'Mumbai'")
print(df_pb.query("City == 'Delhi' or City == 'Mumbai'"), "\n")

print("   Combined logical condition â†’ (Age > 25 and City == 'Delhi') or (Salary > 60000)")
print(df_pb.query("(Age > 25 and City == 'Delhi') or (Salary > 60000)"), "\n")

# ----------------------------------------------
# 3ï¸âƒ£ Using Variables Inside Query
# ----------------------------------------------

min_age = 25
target_city = "Delhi"

print("3ï¸âƒ£ Using Variables â†’ Age > @min_age and City == @target_city")
print(df_pb.query("Age > @min_age and City == @target_city"), "\n")

# ----------------------------------------------
# 4ï¸âƒ£ Filtering with Lists (using `in` / `not in`)
# ----------------------------------------------

print("4ï¸âƒ£ City IN ['Delhi', 'Mumbai']")
print(df_pb.query("City in ['Delhi', 'Mumbai']"), "\n")

print("   City NOT IN ['Delhi', 'Mumbai']")
print(df_pb.query("City not in ['Delhi', 'Mumbai']"), "\n")

# ----------------------------------------------
# 5ï¸âƒ£ Filtering on Numeric Ranges
# ----------------------------------------------

print("5ï¸âƒ£ Age BETWEEN 25 and 35 â†’ (25 <= Age <= 35)")
print(df_pb.query("25 <= Age <= 35"), "\n")

# ----------------------------------------------
# 6ï¸âƒ£ Filtering Using Expressions
# ----------------------------------------------

print("6ï¸âƒ£ Salary > Age * 2000")
print(df_pb.query("Salary > Age * 2000"), "\n")

# ----------------------------------------------
# 7ï¸âƒ£ Combining Query Results with .loc or Variables
# ----------------------------------------------

print("7ï¸âƒ£ Store query result in a variable (Age > 25 and City == 'Delhi')")
filtered_df = df_pb.query("Age > 25 and City == 'Delhi'")
print(filtered_df, "\n")

print("   Use .query() results with .loc for further filtering (Salary > 50000)")
print(df_pb.loc[df_pb.query("Salary > 50000").index, ["Name", "City", "Salary"]], "\n")

# ----------------------------------------------
# 8ï¸âƒ£ Querying with String Columns and Logical NOT
# ----------------------------------------------

print("8ï¸âƒ£ City != 'Delhi'")
print(df_pb.query("City != 'Delhi'"), "\n")

# ----------------------------------------------
# 9ï¸âƒ£ Querying with Complex Expressions
# ----------------------------------------------

print("9ï¸âƒ£ Age ** 2 > 800")
print(df_pb.query("Age ** 2 > 800"), "\n")

print("   (Salary / Age) > 1500 and City == 'Delhi'")
print(df_pb.query("(Salary / Age) > 1500 and City == 'Delhi'"), "\n")

# ----------------------------------------------
# ðŸ”Ÿ Chaining Query with Other Operations
# ----------------------------------------------

print("ðŸ”Ÿ Filter â†’ Sort â†’ Select Columns")
result = (
    df_pb.query("City == 'Delhi' and Age > 25")[["Name", "Age", "Salary"]]
    .sort_values("Salary", ascending=False)
)
print(result, "\n")

# ----------------------------------------------
# âœ… Summary
# ----------------------------------------------
# .query() is powerful for:
# - Readable and SQL-like filtering
# - Dynamic conditions with variables (@var)
# - Handling multiple logical operations cleanly
# - Reducing parentheses clutter compared to boolean indexing

ðŸ”¹ Original DataFrame:
     Name  Age     City  Salary
0   Amit   22    Delhi   40000
1   Neha   27   Mumbai   52000
2    Raj   35    Delhi   61000
3  Priya   29     Pune   48000
4  Karan   40    Delhi   72000
5  Anita   25  Chennai   45000

1ï¸âƒ£ Basic Filtering â†’ Age > 25
    Name  Age    City  Salary
1   Neha   27  Mumbai   52000
2    Raj   35   Delhi   61000
3  Priya   29    Pune   48000
4  Karan   40   Delhi   72000

2ï¸âƒ£ AND condition â†’ Age > 25 and City == 'Delhi'
    Name  Age   City  Salary
2    Raj   35  Delhi   61000
4  Karan   40  Delhi   72000

   OR condition â†’ City == 'Delhi' or City == 'Mumbai'
    Name  Age    City  Salary
0   Amit   22   Delhi   40000
1   Neha   27  Mumbai   52000
2    Raj   35   Delhi   61000
4  Karan   40   Delhi   72000

   Combined logical condition â†’ (Age > 25 and City == 'Delhi') or (Salary > 60000)
    Name  Age   City  Salary
2    Raj   35  Delhi   61000
4  Karan   40  Delhi   72000

3ï¸âƒ£ Using Variables â†’ Age > @min_age and City == @target_city
    Name  Age   City  Salary
2    Raj   35  Delhi   61000
4  Karan   40  Delhi   72000

4ï¸âƒ£ City IN ['Delhi', 'Mumbai']
    Name  Age    City  Salary
0   Amit   22   Delhi   40000
1   Neha   27  Mumbai   52000
2    Raj   35   Delhi   61000
4  Karan   40   Delhi   72000

   City NOT IN ['Delhi', 'Mumbai']
    Name  Age     City  Salary
3  Priya   29     Pune   48000
5  Anita   25  Chennai   45000

5ï¸âƒ£ Age BETWEEN 25 and 35 â†’ (25 <= Age <= 35)
    Name  Age     City  Salary
1   Neha   27   Mumbai   52000
2    Raj   35    Delhi   61000
3  Priya   29     Pune   48000
5  Anita   25  Chennai   45000

6ï¸âƒ£ Salary > Age * 2000
Empty DataFrame
Columns: [Name, Age, City, Salary]
Index: []

7ï¸âƒ£ Store query result in a variable (Age > 25 and City == 'Delhi')
    Name  Age   City  Salary
2    Raj   35  Delhi   61000
4  Karan   40  Delhi   72000

   Use .query() results with .loc for further filtering (Salary > 50000)
    Name    City  Salary
1   Neha  Mumbai   52000
2    Raj   Delhi   61000
4  Karan   Delhi   72000

8ï¸âƒ£ City != 'Delhi'
    Name  Age     City  Salary
1   Neha   27   Mumbai   52000
3  Priya   29     Pune   48000
5  Anita   25  Chennai   45000

9ï¸âƒ£ Age ** 2 > 800
    Name  Age   City  Salary
2    Raj   35  Delhi   61000
3  Priya   29   Pune   48000
4  Karan   40  Delhi   72000

   (Salary / Age) > 1500 and City == 'Delhi'
    Name  Age   City  Salary
0   Amit   22  Delhi   40000
2    Raj   35  Delhi   61000
4  Karan   40  Delhi   72000

ðŸ”Ÿ Filter â†’ Sort â†’ Select Columns
    Name  Age  Salary
4  Karan   40   72000
2    Raj   35   61000